nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Device_808.c
    //------------- PE11 --------------
   gpio_init.GPIO_Pin	 = GPIO_Pin_11;				//------PIN 9   刹车灯
   gpio_init.GPIO_Mode  = GPIO_Mode_IN; 
   GPIO_Init(GPIOE, &gpio_init);
    //------------- PE10 --------------
   gpio_init.GPIO_Pin	 = GPIO_Pin_10;				//------PIN 10  雨刷
   gpio_init.GPIO_Mode  = GPIO_Mode_IN; 
   GPIO_Init(GPIOE, &gpio_init);  
 
   //-----------------------------------------------------------------
   

   //------- 速度信号线 ---------------
    gpio_init.GPIO_Pin = GPIO_Pin_0; 
    gpio_init.GPIO_Mode = GPIO_Mode_AF;
    gpio_init.GPIO_Speed = GPIO_Speed_100MHz; 
    gpio_init.GPIO_OType = GPIO_OType_PP;
    gpio_init.GPIO_PuPd  = GPIO_PuPd_NOPULL; 
    GPIO_Init(GPIOA, &gpio_init); 
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_TIM2); 


#if 1
   // -----    硬件版本状态监测 init  ---------------------- 
   /*
	PA13	1	复用硬件版本判断
	PA14	1	复用硬件版本判断
	PB3       0	复用硬件版本判断
    */
       //------------- PA13 --------------   
   gpio_init.GPIO_Pin	 = GPIO_Pin_13;				
   gpio_init.GPIO_Mode  = GPIO_Mode_IN; 
   GPIO_Init(GPIOA, &gpio_init);  
         
    //------------- PA14 --------------
   gpio_init.GPIO_Pin	 = GPIO_Pin_14;				
   gpio_init.GPIO_Mode  = GPIO_Mode_IN; 
   GPIO_Init(GPIOA, &gpio_init);
    //------------- PB3 --------------
   gpio_init.GPIO_Pin	 = GPIO_Pin_3;				
   gpio_init.GPIO_Mode  = GPIO_Mode_IN;  
   GPIO_Init(GPIOB, &gpio_init);  
#endif   

}





/*    
     -----------------------------
    1.    输入管脚状态监测
     ----------------------------- 
*/
u8  ACC_StatusGet(void)
{  
    // ACC 状态引脚   
    //返回  非0 为  ACC 开   
    //返回  0  为   ACC 关
   return(!GPIO_ReadInputDataBit(ACC_IO_Group,ACC_Group_NUM)); 
}

u8  WARN_StatusGet(void)
{
    // 紧急报警 状态引脚   
    //返回  非0 为  报警按钮按下  
    //返回  0  为   报警按钮断开
   return (!GPIO_ReadInputDataBit(WARN_IO_Group,WARN_Group_NUM));   
}
u8  MainPower_cut(void)
{ 
    // 断电报警 状态引脚   
    //返回  非0 为  主电断开  
    //返回  0  为   主电工作 
 // return (GPIO_ReadInputDataBit(POWER_IO_Group,POWER_Group_NUM)&0x01) ; 
   return false;
}

u8  FarLight_StatusGet(void)
{
  //  --------------J1pin2		Pc0		远光灯
	   return (!GPIO_ReadInputDataBit(FARLIGHT_IO_Group,FARLIGHT_Group_NUM));	// PE6
	//		 接高  触发
}
u8  NearLight_StatusGet(void)
{
  //  --------------J1pin2		Pc1 		远光灯
	   return (!GPIO_ReadInputDataBit(NEARLIGHT_IO_Group,NEARLIGHT_Group_NUM));	// PE6
	//		 接高  触发
}

u8  FogLight_StatusGet(void)
{
  //  --------------J1pin2		Pc3 		雾灯
	   return (!GPIO_ReadInputDataBit(FOGLIGHT_IO_Group,FOGLIGHT_Group_NUM));	// PE6
	//		 接高  触发
}
u8 WarnLight_StatusGet(void)
{
       //  --------------J1pin3	   PD9			报警灯
	   //return (!(GPIO_ReadInputDataBit(WARNLIGHT_IO_Group,WARNLIGHT_Group_NUM));	// PD9
	   return false;
			//		 接高  触发
}		
u8 Speaker_StatusGet(void)
{
   //  --------------J1pin4 	 PC6		喇叭 ---车门开关拍照
	   return (!GPIO_ReadInputDataBit(SPEAKER_IO_Group,SPEAKER_Group_NUM));	// PC2 
			//		 接高  触发
}			
u8  LeftLight_StatusGet(void)
{
  //  --------------J1pin5	   PC7		   左转灯
	   return (!GPIO_ReadInputDataBit(LEFTLIGHT_IO_Group,LEFTLIGHT_Group_NUM));	//	PC7 
			//		 接高  触发
}	
u8  DoorLight_StatusGet(void)
{
 //  --------------J1pin6	   PC1		  车门灯
	   return (!GPIO_ReadInputDataBit(DOORLIGHT_IO_Group,DOORLIGHT_Group_NUM));	// PC1
			//		 接高  触发
}		
u8  RightLight_StatusGet(void)
{
//	--------------J1pin7   PC9			  右转灯
		 return(!GPIO_ReadInputDataBit(RIGHTLIGHT_IO_Group,RIGHTLIGHT_Group_NUM));  //PC9 
		     //	   接高  触发 
}			
u8  BreakLight_StatusGet(void)
{
	//	--------------J1pin8	PE11	刹车灯
	   return(!GPIO_ReadInputDataBit(BREAK_IO_Group,BREAK_Group_NUM));	//PE11
			//		 接高  触发
}
u8 RainBrush_StatusGet(void)
{
// --------------J1pin9    PD8			 雨刷 
		return(!GPIO_ReadInputDataBit(RAINBRUSH_IO_Group,RAINBRUSH_Group_NUM));  //PD8 
			//		 接高  触发
}	
/*    
     -----------------------------
    2.  控制输出
     ----------------------------- 
*/
void  Enable_Relay(void)
{  // 断开继电器
 
 GPIO_SetBits(RELAY_IO_Group,RELAY_Group_NUM); // 断开	
}
void  Disable_Relay(void)
{ // 接通继电器
   
   GPIO_ResetBits(RELAY_IO_Group,RELAY_Group_NUM); // 通	 
}


u8  Get_SensorStatus(void)   
{        // 查询传感器状态
   u8  Sensorstatus=0;
   
 /*  
     -------------------------------------------------------------
              F4  行车记录仪 TW703   管脚定义
     -------------------------------------------------------------
     遵循  GB10956 (2012)  Page26  表A.12  规定
    -------------------------------------------------------------
    | Bit  |      Note       |  必备|   MCUpin  |   PCB pin  |   Colour | ADC
    ------------------------------------------------------------
        D7      刹车           *            PE11             9                棕
        D6      左转灯     *             PE10            10               红
        D5      右转灯     *             PC2              8                白
        D4      远光灯     *             PC0              4                黑
        D3      近光灯     *             PC1              5                黄
        D2      雾灯          add          PC3              7                绿      *
        D1      车门          add          PA1              6                灰      *
        D0      预留
   */

   //  --------------J1pin8 		   刹车灯
		  if(BreakLight_StatusGet())  //PA8
		   {   //		接高  触发
			   Sensorstatus|=0x80;
			    BD_EXT.FJ_IO_1 |=0x80;  //  bit7 
			    BD_EXT.Extent_IO_status |= 0x10;  // bit4 ---->刹车
		   }
		  else
		   {  //   常态
			   Sensorstatus&=~0x80;		
			    BD_EXT.FJ_IO_1 &=~0x80;  //  bit7 
			    BD_EXT.Extent_IO_status &= ~0x10; //bit4 ---->刹车
		   } 
	//	-------------- J1pin5			 左转灯
		 if(LeftLight_StatusGet())	//	PC7 
		  {   //	   接高  触发
			  Sensorstatus|=0x40;
			   BD_EXT.FJ_IO_1 |=0x40;  //  bit6
			    BD_EXT.Extent_IO_status |= 0x08;//bit3---->  左转灯
		  }
		 else
		  {  //   常态
			 Sensorstatus&=~0x40; 	
			 BD_EXT.FJ_IO_1 &=~0x40;  //  bit6 
			  BD_EXT.Extent_IO_status &= ~0x08; //bit3---->  左转灯
		  }
   //  -------------- J1pin7				右转灯
	     if(RightLight_StatusGet())	//PC2 
	     {	//		 接高  触发
				Sensorstatus|=0x20;
				 BD_EXT.FJ_IO_1 |=0x20; //bit5
				 BD_EXT.Extent_IO_status |= 0x04;// bit2----> 右转灯
		}
            else
		{  //	常态
			   Sensorstatus&=~0x20;		
		   BD_EXT.FJ_IO_1 &=~0x20; //bit5
		   BD_EXT.Extent_IO_status &= ~0x04;//bit2----> 右转灯
		} 
   
   //  --------------远光灯-----------------------
	   if(FarLight_StatusGet())	// PC0
		{	//		 接高  触发
			Sensorstatus|=0x10;
			BD_EXT.Extent_IO_status |= 0x02; //bit 1  ----->  远光灯
			
