nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Device_808.c
  /* Enable ADC3 DMA */
//  ADC_DMACmd(ADC1, ENABLE);

  /* Enable ADC3 */
  ADC_Cmd(ADC1, ENABLE);

  ADC_SoftwareStartConv(ADC1);

}




//==========================================================
#if 1
void  sys_status(void)
{
     rt_kprintf("\r\n 状态查询: "); 	     
     //-----  报警  ---	 
     if(WARN_StatusGet())
	                 rt_kprintf(" 紧急报警      "); 	      
    //     ACC 	 
     if(ACC_StatusGet())
                        rt_kprintf("ACC 开    "); 
     else
	 	          rt_kprintf("ACC 关    ");  
    //     AD 电压 
    rt_kprintf ("\r\n  获取到的电池AD数值为:	%d	",Power_AD.ADC_ConvertedValue);	  
    rt_kprintf(" AD 电压: %d.%d  V  ",Power_AD.AD_Volte/10,Power_AD.AD_Volte%10);    	        
    //    信号线	 
     rt_kprintf("    %s      ",XinhaoStatus);       
    //   定位模式	
     rt_kprintf("\r\n 定位模式:    ");  
		      switch(GpsStatus.Position_Moule_Status)
		      	{  
		      	         case 1:           rt_kprintf(" BD");  
						 	break;
				  case 2:           rt_kprintf(" GPS ");  
				  	              break;
				  case 3:           rt_kprintf(" BD+GPS");  
				  	              break;
		      	} 
     //   定位状状态
     if(ModuleStatus&Status_GPS)
	 	        rt_kprintf("         定位状态:  定位   卫星颗数: %d 颗 ",Satelite_num);   
    else	 
                      rt_kprintf("         定位状态: 未定位");  	 
    //    GPS 天线状态
    if(GpsStatus.Antenna_Flag==1)
         rt_kprintf("        天线:     断开");  
   else	
   	  rt_kprintf("        天线:     正常");   
    //  欠压报警状态
    if((Warn_Status[3]&0x80)==0x00)  
         rt_kprintf("        电源电压状态:     正常");  
	else
         rt_kprintf("        电源电压状态:      欠压报警");    
     //   GPRS  状态 
    if(ModuleStatus&Status_GPRS)
	 	        rt_kprintf("      GPRS 状态:   Online\r\n");  
    else	 
                      rt_kprintf("      GPRS 状态:   Offline\r\n");  	   
 
}
FINSH_FUNCTION_EXPORT(sys_status, Status);
#endif

void dispdata(char* instr)
{
     if (strlen((const char*)instr)==0)
	{
	     DispContent=1;
	    rt_kprintf("\r\n  默认等于 1\r\n"); 	  
	    return ;
	}
	else 
	{         
	       DispContent=(instr[0]-0x30);    
	  rt_kprintf("\r\n		Dispdata =%d \r\n",DispContent); 
	  return;  
	}
}
FINSH_FUNCTION_EXPORT(dispdata, Debug disp set) ; 


void Socket_main_Set(u8* str)
{
  u8 i=0;
  u8 reg_str[80];
  
	if (strlen((const char*)str)==0){
	    rt_kprintf("\r\n input error\r\n"); 
		return ;
	}
	else 
	{      
	  i = str2ipport((char*)str, RemoteIP_main, &RemotePort_main);
	  if (i <= 4) return ;;
	   
	  memset(reg_str,0,sizeof(reg_str));
	  IP_Str((char*)reg_str, *( u32 * ) RemoteIP_main);		   
	  strcat((char*)reg_str, " :"); 	  
	  sprintf((char*)reg_str+strlen((const char*)reg_str), "%u\r\n", RemotePort_main);  
         memcpy((char*)SysConf_struct.IP_Main,RemoteIP_main,4);
	  SysConf_struct.Port_main=RemotePort_main;
	 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));

        DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
		 DataLink_EndFlag=1; //AT_End();  
			return ;
	}

}
FINSH_FUNCTION_EXPORT(Socket_main_Set,Set Socket main); 

  void Socket_aux_Set(u8* str)
  {
	u8 i=0;
	u8 reg_str[80];
	
	  if (strlen((const char*)str)==0){
		  rt_kprintf("\r\n input error\r\n"); 
		  return ;
	  }
	  else 
	  { 	 
		i = str2ipport((char*)str, RemoteIP_aux, &RemotePort_aux);
		if (i <= 4) return ;;
		 
		memset(reg_str,0,sizeof(reg_str));
		IP_Str((char*)reg_str, *( u32 * ) RemoteIP_aux);		 
		strcat((char*)reg_str, " :");		
		sprintf((char*)reg_str+strlen((const char*)reg_str), "%u\r\n", RemotePort_aux);  
	    memcpy((char*)SysConf_struct.IP_Aux,RemoteIP_aux,4);
		SysConf_struct.Port_Aux=RemotePort_aux;
	    Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
  
		  DataLink_AuxSocket_set(RemoteIP_aux,RemotePort_aux,1);
			  return ;
	  }
  
  }
//  FINSH_FUNCTION_EXPORT(Socket_aux_Set,Set Aux main); 


  void  debug_relay(u8 *str)  
{
 if (strlen((const char*)str)==0)
	{
       rt_kprintf("\r\n继电器(1:断开0:闭合)JT808Conf_struct.relay_flag=%d",JT808Conf_struct.relay_flag);
       }
else 
	{
	       if(str[0]=='1')
		{
		 Car_Status[2]|=0x08;     // 需要控制继电器
		JT808Conf_struct.relay_flag=1;
		Enable_Relay();
		rt_kprintf("\r\n  断开继电器,JT808Conf_struct.relay_flag=%d\r\n",JT808Conf_struct.relay_flag); 
		}
	else if(str[0]=='0')
		{
		Car_Status[2]&=~0x08;    // 需要控制继电器
		JT808Conf_struct.relay_flag=0;
		Disable_Relay();
		rt_kprintf("\r\n  接通继电器,JT808Conf_struct.relay_flag=%d\r\n",JT808Conf_struct.relay_flag); 
		}
	}
 Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
 rt_kprintf("\r\n(debug_relay)状态信息,[0]=%X  [1]=%X  [2]=%X  [3]=%X",Car_Status[0],Car_Status[1],Car_Status[2],Car_Status[3]);	
 }
//FINSH_FUNCTION_EXPORT(debug_relay, Debug relay set) ;

//==========================================================
 
/*    
     -----------------------------
    3.  RT 驱动相关
     ----------------------------- 
*/



/*

       新驱动应用
 
*/



  //  1 .  循环存储 
      u8       Api_cycle_write(u8 *buffer, u16 len) 
      {
       // if(rt_mutex_take(DF_lock_mutex,150)==RT_EOK) 
	   {
	          WatchDog_Feed();
	          if( SaveCycleGPS(cycle_write,buffer,len))
		     { //---- updata pointer   -------------		
				cycle_write++;  	
			       if(cycle_write>=Max_CycleNum)
			  	               cycle_write=0;  
				DF_Write_RecordAdd(cycle_write,cycle_read,TYPE_CycleAdd);   
				DF_delay_us(20);  
		        //-------------------------------	
		       // rt_mutex_release(DF_lock_mutex);  //  释放
		        return true;
	            }  
		    else
		    {		         
				 //-------------------------------	 
				// rt_mutex_release(DF_lock_mutex);  //  释放
			     return  false;  
		    }	 
        }
	//	else
		//	 return false;
  	}

      u8      Api_cycle_read(u8 *buffer, u16 len) 
      {
                return( ReadCycleGPS(cycle_read, buffer, len));
  	}
       u8     Api_cycle_Update(void)
       {
           	 if( ReadCycle_status==RdCycle_SdOver)	 // 发送成功判断 
				 {		 
					 cycle_read++;	 //  收到应答才递增
					 if(cycle_read>=Max_CycleNum)
							cycle_read=0;
					 ReadCycle_status=RdCycle_Idle; 
					  rt_kprintf("\r\n 发送 GPS --saved  OK!\r\n");    
					   ReadCycle_timer=0; 
				 }	
				 return 1;
      }
	u8   Api_CHK_ReadCycle_status(void)
	{
                  CHK_ReadCycle_status();    // 发送状态的检查
		     return true;
	}

 // 2. Config 
        u8    Api_Config_write(u8 *name,u16 ID,u8* buffer, u16 wr_len)  
 	{
                if(strcmp((const char*)name,config)==0)
                {
                     DF_WriteFlashSector(ConfigStart_offset, 0, buffer, wr_len);
			DF_delay_ms(5);
			return true;		 
                }  
		   if(strcmp((const char*)name,tired_config)==0)
                {
                     DF_WriteFlashSector(TiredCondifg_offset, 0, buffer, wr_len);
			return true;		 
                } 		
		 return false;		
 	}
       u8      Api_Config_read(u8 *name,u16 ID,u8* buffer, u16 Rd_len)    //  读取Media area ID 是报数
       {
            if(strcmp((const char*)name,config)==0)
           	{
                     DF_ReadFlash(ConfigStart_offset, 0, buffer, Rd_len); 
					 DF_delay_ms(80); 	// large content delay	
					 return true;		
           	}
              if(strcmp((const char*)name,jt808)==0) 
             	{   
             	     WatchDog_Feed(); 
                     DF_ReadFlash(JT808Start_offset, 0, buffer, Rd_len); 
			         DF_delay_ms(100); // large content delay
			         return true;	
             	}
		   if(strcmp((const char*)name,tired_config)==0)
                {
                     DF_ReadFlash(TiredCondifg_offset, 0, buffer, Rd_len);
			DF_delay_ms(10); 		 
			return true;		 
                } 	  
     		   if(strcmp((const char*)name,BD_ext_config)==0)
     		   {
                     DF_ReadFlash(DF_BD_Extend_Page, 0, buffer, Rd_len); 
			DF_delay_ms(10); 		 
			return true;	
     		   }
         return false;
			
